{"comments": [{"author": "MattQb", "date": "2007-10-17 05:28:00", "content": "I agree, Japan is very convenient.<br/>There is one thing, have you considered the possibility of Holland just being not convenient at all compared to the rest (don't take offend)?<br/>For exemple, combini's are well spread over here in Québec since a long time ago. We call them \"dépanneur\" (litt. a \"helper-in-your-daily-life\"). However you cannot pay bills or buy tickets at the dépanneur :P<br/>The train system goes also with the need... So many Japanese out there..."}, {"author": "Anonymous", "date": "2007-10-17 07:50:00", "content": "Well, there's also similar stores like conbini's in Holland, and the train system at least in my province is quite good, even if there are not as many trains as here, they are usually on time. I like to make things a bit more extreme on my blog :P"}, {"author": "Anonymous", "date": "2007-10-17 15:26:00", "content": "It's true,Japan is good,safe,convient place.I can't wait until my aniversary."}, {"author": "Anonymous", "date": "2007-10-17 15:29:00", "content": "Don't be sad.If you want,I can company with you to congradulate your aniversary.^__^"}, {"author": "heidemeisje", "date": "2007-10-18 16:59:00", "content": "Holland is the most quiet country of the world. With no exhaust fumes or smog (not as much as in japan). when you want to be in a place where there are no sounds around you, in japan you really have too look hard. Holland is more peacefully then any other country. And all the people in japan(there are just too much). In holland when you get in a train, most of the times you can sit!<br/>So holland has his positive things. My englisch sucks because it's a long time ago for me, typing english. Excuse me for that. <br/><br/>Randy i don't know when you're anneversary is, so congratulations for you're 2 year stay in japan. <br/><br/>you're little sister."}, {"author": "Randy", "date": "2007-10-20 02:42:00", "content": "Haha, dank u :) Ik bel binnenkort nog wel ff. Het is de 29e trouwens."}]}