{"comments": [{"author": "刘", "date": "2007-06-07 06:43:00", "content": "So , you should come back from holland earlier! you will be together with your parents eventually ,  but maybe you can't see us that easy. Randy , you are nice. hahahaaha . Trust yourself.<br/><br/>btw, the pics you took yesterday for the bread, is soooo disgustiing"}, {"author": "heidemeisje", "date": "2007-06-08 20:55:00", "content": "waste of you're time. ok maybe it's  time to make up you're mind!.  you're friends won't even now you when you made it and have a nice paying job and they are all gone to other places in the world, in a couple of years. And if you think they would ever say, hey we missed randy that week or 2 before we went away, you are really messed up. but if you just stay a week or 2 in holland you're parrents will say, i wish he was here just a little bit longer! i'm a little bit disappointed big brother. i just wish you didn't have to make a disision about who you would like to see longer. I think now you're friends can understand my thoughts,  in dutch the wouldn't understand. but don't take this to hard. I'm youre little sister. and you don't have tp listen to me. you know that."}, {"author": "MattQb", "date": "2007-06-10 13:25:00", "content": "It's all about choices. You have to weight your options of course. I'm not going to tell you to do this or that, but I think that saying that you can see your siblings later is a bit dangerous. The danger reside in the fact that it's an easy, short-time solution, and could be the solution whenever you face a hard choice again. At the end, you would not see people as often as you wanted to. And you're pissed off.<br/>I have known many people in my live, and will know many others. Each time I used to know someone, I just try to enjoy time passed with that person."}, {"author": "Kamil", "date": "2007-06-10 16:48:00", "content": "Maybe Matthieu QB is right - it is also something I have just started to learn as well.<br/><br/>I don't think going back to Holland would be a waste of time for you - you get to spend time with the people who care the most about you. As you grow older, you will find that the time you get to spend with your family will become less and less. Its true for my case at least. So even going back to HK just for a few days, I'm glad to have made the effort.<br/><br/>Enjoy your time back home - your true friends will always be there for you. You will never loose them. Just look at you and Yu Huan. However, there are always friends who come and go - its just life.<br/><br/>One group you will always be part of is your family, so you should be happy."}]}