{"comments": [{"author": "Iggy", "date": "2010-01-13 14:48:26", "content": "thx, i was just about to buy this mindset for the same reasons. Now i changed my mind, I'll rather wait for next improved edition or buy something else"}, {"author": "Simon", "date": "2010-01-17 21:49:13", "content": "I was also considering buying one... I'd use it with a Mac, which might crash a bit less often... but also provide fewer apps, which doesn't matter so much since I was gonna roll my own. Because of the openness (\"right mindset\" as you said) of the product/company I found it more appealing than Emotiv's EPOC. I think I'll just check out Emotiv's lite SDK (that's free to download but not connectable to any hardware) to see if I find their SDK appealing. If I do I might actually buy it and start booting my Mac into Windows more often. :) Their SDK+developer headset is already available for worldwide delivery, while as the consumer version is only available to US destinations (in a couple of months this'll probably change). (Another thing to play with could be OCZ's NIA, but that one doesn't have any official SDK yet and only reads alpha and beta waves + some facial expressions.) So Emotiv's EPOC pretty much does all, while as NeuroSky's MindSet and OCZ's NIA pretty much different things. But here's something cool that someone did with the OCZ NIA at least: http://www.ngen.us/?tag=nia (And it's a cheap device.)"}, {"author": "Simon", "date": "2010-01-17 23:12:43", "content": "Hmmm... I have a hard time finding anyone else saying it works very poorly, but I'm not finding anyone stating that it works very well either. Do you know any other reviews, where the product was actually tried out? (Most just reference what they've seen or heard.) I'm just thinking that you might have some faulty hardware somewhere, or something."}, {"author": "rheide", "date": "2010-01-18 12:22:34", "content": "It could be faulty hardware, but I am getting a response. I'd pursue it further, but I won't have time in the near future. If you really want to get one soon I think the alternatives you mentioned are also interesting. As far as the SDK goes the NeuroSky is not bad though."}, {"author": "andy", "date": "2010-01-23 02:46:46", "content": "If you ever do write a program and the thing ever does work, how about doing a meditation program? I would really like to know what is going on in my brain when I try to meditate. They say deep meditation really fires up delta waves. And also that deep sleep also produces delta waves. A lot of folks don't get enough sleep. Being able to have effective meditation with delta waves could be a way to make up for missed sleep. And a guided meditation program with this headset might make it easier to do. It the bluetooth is such an issue maybe they should make a wired headset. And it seems like they should have more than one sensor on the head to make it work."}, {"author": "Me", "date": "2010-02-04 22:54:47", "content": "Thanks for the review...it was comical but informative...."}, {"author": "sivgan@hotmail.com", "date": "2010-02-14 10:14:57", "content": "Hi<br/><br/>Does anybody know this mindset + their applications can improve brain power?<br/><br/>Thanks"}, {"author": "sivgan@hotmail.com", "date": "2010-02-14 10:16:08", "content": "Hi<br/><br/>Does anybody know this mindset + their applications can improve brain power?<br/><br/>I have ordered one just now<br/><br/>Thanks"}, {"author": "Cordless Screwdriver ·", "date": "2010-11-12 21:07:47", "content": "bluetooth headsets are great because they are wireless and your movement is not limited by wires :-\""}, {"author": "Sven", "date": "2010-12-16 15:40:01", "content": "Hi. Based on reviews and pros/conc of all the discussed different solutions, I invested in this NeuroSky MindSet and use it with Win7. I also have had some bad experience with the connection, but it seems like it was always due to the Bluetooth setup/paring. When it is properly connected the wawes are transmitted very well after approx half a minute, and the sensors are not as depending on contact etc as I had expected with only one main forehead sensor and 3 ear sensors.<br/><br/>The connection problem<br/>Please note that I use the standard Laptop Bluetooth (BT) connection, and not the dongle. I fear that two BT conenctions from the same PC with Win7 can only make my issues worse. What puzzled me first a few times was, that even the Visualizer informs a connection but no wave signal, it is not the sensor signals which is blocked by missing brainwave contact, but actually the bluetooth data which is not transferred. Because, when checking the bluetooth connection within the properties for the specific device in Win7, it informs the date and time for last connection, and NOT \"Currently connected\" (which it does when it works). In my case I expected the reason for the inproper setup was that I had also paired the MindSet with my mobile phone at some time, and maybe the pairing with the PC was damaged, but maybe this is not the full story - I don't know. But after removal of the bluetooth MindSet device (setup) in the Win7, rebooting of the PC, and a new pairing of MindSet and laptop, it seems to connect just fine every time.<br/><br/>But on top of this, when starting up data transfer it seems like it often requires more than 10 seconds to settle and show that there are data available, so if you are impatient and are moving the sensor it seems like it starts all over this settling, and the experience is that it \"never connects\".<br/><br/>I have subjective experience that the settling is improved if I moist the sensors a little. Don't tell my son at 12 year, that I use spit on a finger, as he also uses the headset and enjoy playing and experimenting with it ;-). So if I moist the sensors, place the forehead sensor relatively close to my eyebrown, and be a little patient with the data settling, it seems to be very consistent and stable with Win7.<br/><br/>So the first hurdle is to get the BT paired well which is possible with direct bluetooth in Win7 from a standard laptop if not trying to use the headset with other devices. The sound is so bad anyway, which is also noted previsouly. And then learn how to handle the sensors (not moving them constantly to try to get connection). Maybe moist the forehead sensor and place it just above the eyebrown.<br/><br/>If this basic BT setup is in place, it seems like even a 12 year old boy can start it up and use it after a little introduction of the handling.<br/><br/>Just a note rgd. wired headset. I believe that the reason why the MindSet works so relatively stable regardless of few sensors, is that it is wireless, so all the grounding noise issues are out of the way. I read that noise is the main reason for unstable behavior by other wired sensor-solutions, where you have to touch something or sit very tight. The signals from the sensors are very weak, and these solutions are inheriently very sensitive to gound/chassis noise, unless designed 100% balanced with a very high common mode rejection. Especially in PC environments with switching power supplies and clock circuitries with fast rise times, making the ground jumping up and down many places in the signal path. Also gound loops are common, and the long wires pick up noise from various electromagnetic sources around the PC. So NeuroSky, if you read this, keep the wireless solution, but make the BT pairing / connection easier to use and more stable. It should also be easy to improve the sound quality ;-).<br/><br/>Actually I wish the MindSet unit did not have the headset capability, but only the sensors, so I could use it without covering both ears, as I always turn down the sound anyway (terrible sound quality and I prefer to meditate without music). Also, the earcups makes my ears warm, and limit my meditation time, because they my attention are turned towards them instead. And it would last longer on the battery as the power for sound circuitries etc are eliminated.<br/><br/>Has anyone seen an application where I can log the \"Meditation\" level e.g. every half second, and get a graph of a meditation session over time (like one hour)? Or is this easy to develop with the SDK?<br/><br/>Regards<br/>Sven"}, {"author": "Ken", "date": "2011-01-12 18:50:41", "content": "Thanks for the review. I'm not sure if the product has improved since you used it last, but I see it all over online these days. i think this morning I found it on twitter and gizmo.com.<br/><br/>Have you heard or tried the new version?"}, {"author": "pedro", "date": "2011-07-17 21:56:01", "content": "Now I just bought a mindset and use it on windows vista , although the headphones sound is absolutely fantastic the connectivity problems with the bluetooth is just the same. <br/>Everytime i switch on the pc i have to re-pair and sometimes more than once , it's july 2011 and they still sell this product with the same problem,neurosky support is the same as talking to a wall.<br/>They offered me a refund after all...but not a solution for the problem."}, {"author": "Joseph", "date": "2012-03-29 11:39:15", "content": "I just purchased the Mindset and had it up and running within 15 minutes no problems with control; easy as pie. However; that was the only time it worked (about 90 minutes). I have now spent several hours over the last two days trying to get the waves to show up in the visualizer and I cannot get a solid signal. I am very disappointed with this product that I purchased to record my brainwaves while meditating and using audio entrainment programs. I will be returning it promptly."}]}