{"comments": [{"author": "b", "date": "2010-09-27 08:30:57", "content": "Hey guy, I'm happy to see you've continued on blogging. I lost momentum somewhere, and even though I've been in Africa for a month, I haven't been bothered to say much about it yet. Everything in time, though - as far as creative works go, better to do them when you really feel like it.<br/><br/>I'm also happy to see you've caught a bit of the bug and have continued on coding up new and exciting ideas, and learning a bunch along the way. Although (as you pointed out quite well) it was a stressful short \"slice\" of time, I enjoyed our back-in-the-habit retreat immensely, and look forward to continuing the project when I'm in an environment with better than shit-tier Internet.<br/><br/>As for YC, the synthesis of what I've read there is that you have to be both sides of the coin: not \"optimist\" and \"pessimist\" (because those are opposing ways to perceive the same situation), but \"visionary\" and \"realist\" instead. The visionary aspect has the balls to dream big, and the realist aspect complements this by staying focused on the practical way to accomplish the dream.<br/><br/>Optimism is critical because if you can't believe in your own project, how is a customer or investor supposed to? However, optimism won't save you if you can't deliver the goods. Pessimism is useful because things rarely go as planned, but if you're wracked with self-doubt, they won't go anywhere at all. Again, since they are two ways of perceiving the same situation, why not explore them? Perception is free, and it might be enlightening.<br/><br/>In the end, though, it's vision and realism - two sides of the same coin, both dedicated to accomplishing something well, both necessary to succeed. Vision without realism is delusion; realism without vision is banality; combined, they are a force to be reckoned with. One that both optimists and pessimists will have to acknowledge."}, {"author": "What I&#8217;ve Been Reading &#8211; 2010-10-01 | Jeremiah Peschka", "date": "2010-10-01 14:05:15", "content": "[...] Gurus and Bastards What&#8217;ll it be? Helpful optimistic guru or grumpy bastard? [...]"}]}