{"comments": [{"author": "Shanna", "date": "2010-04-26 13:05:05", "content": "whether to stay here forever or go HOME.<br/>Hah zo voel je het dus nog wel steeds!"}, {"author": "Kamil", "date": "2010-04-26 14:18:16", "content": "Yeah Shanna, I am persuading him to come back to Europe :)"}, {"author": "vincent", "date": "2010-04-26 15:14:24", "content": "Thanks for your thoughts. Just I stay in Kanto. I'm afraid of getting depressed to see that Japan is the same wherever you travel through this country. Hey, and I liked your thought about The Great Japan:\"Japan is great if you can accept the Japanese lifestyle and don’t try to change it\". Anyway, living in Japan is a great experience and I'm sure your trip will also be invaluable even if it sometimes sucks. No great things without sucking things"}, {"author": "Alex", "date": "2010-04-26 19:32:44", "content": "Interesting that you are thinking about that now, after a couple of years… I had the opposite feeling, a month after I arrived, I was (seriously) pissed at Japan, for being like it is. I had, for the first time in my life this craving for _lying down in the grass_. Something _totally impossible_. Then, I don't really know what happened, I grew to like it. To like its dirt covered parks, the concrete, the weird things.<br/><br/>I must say that I still hate the highways, completely closed with walls, and that I have never experienced going cross country in a bike.<br/><br/>Question: Why are you on such a tight schedule?!"}, {"author": "rheide", "date": "2010-04-27 05:53:44", "content": "Lying down in the grass sounds awesome! I'm putting my hopes in Kyushu for that one. In my mind Kyushu's always been a little bit different. In fact, I remember drinking a beer at a riverside park in Nagasaki which was awesome.<br/><br/>As for the tight schedule, I guess I'm still trying to get away from 'the Japan I know'. There's not a lot of surprises in this area for me and the weather is shit, so I might as well surf through it quickly. It's also my personality disorder of always wanting to be on time :P"}, {"author": "alvaro", "date": "2010-04-27 17:25:42", "content": "I really liked your comment about not to loiter outside designated areas being part of the Japanese culture.<br/><br/>About laying down in the grass I cannot help but agreeing with you guys.  I have been able to do that only in a very few places, and half of them needed paid entrance.<br/><br/>But I think all that is directly connected to the proverbial efficiency of the society.  Although loitering and laying down in the grass does great for the mind, it seems that the LDP answer has been much more less social in that aspect, and preferred to focus on infrastructure (as in highways), education and economy, leaving art and leisure mostly to private institutions.<br/><br/>But personally I was never pissed off because of that difference.  Like any other different society it doesn't mean that is wrong, it only means like you wisely pointed out that you need to adapt, leave, or be condemned to an eternal nagging state of mind.<br/><br/>I can't wait to read about your impressions of Kyushu."}, {"author": "IlikeExperimentalFolk", "date": "2010-12-15 07:47:08", "content": "Wonder what it'd be like roaming at Japan pre-Edo period? I guess there would be a lot of greens, that would suit me very well. Much plains to hang around and more practice of spirituality by pre-Edo manner."}]}