{"comments": [{"author": "Kamil", "date": "2010-05-14 10:28:00", "content": "Yoron was barely beautiful...it was an inhabited rock in the middle of the Pacific! Japanese has a serious romantic idea about Europe!! However I do like what the word Yoron has come to symbolise :) Continue safely with the rest of ur 600KM..."}, {"author": "missartgirl", "date": "2010-05-14 13:13:16", "content": "&lt;3<br/>Holland is the most beautiful place in Europe&lt;3&lt;3"}, {"author": "Lisa", "date": "2010-05-14 13:21:06", "content": "It's like a living diorama - the picture of the bottle-sized Holland is amazing. And this is one of my favorite things when I travel - to see how the rest of the world interprets my country. Thanks for posting this!"}, {"author": "scargirl", "date": "2010-05-14 13:36:08", "content": "Love the photos. I am a keen user of great photos on my site, too. They really do express mood and emotion."}, {"author": "melanirae", "date": "2010-05-14 13:37:17", "content": "I love windmills! I want to live in one someday. Love that first shot."}, {"author": "misplacedperson", "date": "2010-05-14 13:56:46", "content": "Mini-Holland? Good grief, surely Holland is small enough already. Certainly isn't big enough to contain all the Dutch, judging by how many of them you bump into all over the rest of the world! :-D"}, {"author": "thecodger", "date": "2010-05-14 14:05:45", "content": "That looks spectacular. Leave it to Japan to create something so extraordinary! My grandson has spent some time in Holland. I'm going to send him this article--I think he'll really enjoy it.<br/><br/>The Codger<br/>http://thecodger.wordpress.com/"}, {"author": "Raul Alanis", "date": "2010-05-14 14:09:27", "content": "Manual focusing makes for better pictures anyway.  If your shutter isn't working correctly, try setting the timer so that you don't risk a blur when you take the pic and it allows you to steady the shot.<br/><br/>www.wutevs.wordpress.com"}, {"author": "Breland Kent (Wild Focus)", "date": "2010-05-14 15:31:30", "content": "Wow, that's really cool. I never knew they had such places. It looks like a movie set or something. I would love to go to something like this."}, {"author": "idlechameleon", "date": "2010-05-14 15:42:18", "content": "Your first photo is beautiful. I just bought my fist DSLR, a Nikon D5000, a few months ago. Have fun on your cycling trip and take more photos!"}, {"author": "interpretartistmama", "date": "2010-05-14 16:15:33", "content": "I enjoy seeing how the rest of the world interprets my country (Russia) too. Two of my favorite comments that I often get when I tell people I am originally from there:<br/><br/>1. Oh! Maybe you've met my uncle's daughter-in-law's ex-boyfriend's sister's hair dresser? She lives in Russia!<br/><br/>2. So I bet you're pretty used to the cold, huh?"}, {"author": "GraceKay", "date": "2010-05-14 18:46:49", "content": "The pictures turned out really good even with all of your camera problems. Nice post, I wish I were able to be a little more adventurous."}, {"author": "D Light", "date": "2010-05-14 22:29:40", "content": "Truly, nice photos I wish my pictures on blog were as clear but I am just using a point and shoot digital. Thanks for sharing this I never knew this existed in Japan. Just like the goal of my site is to show a not over know site of Nice,France www.crazyparking.com<br/>D"}, {"author": "Sondra Padalecki", "date": "2010-05-14 23:54:19", "content": "Great article and fantastic photos ! I have been to Holland and loved these pics ! You are a very good photographer and story teller, keep it up !"}, {"author": "Michelle UluOla", "date": "2010-05-15 01:35:16", "content": "LOL! Japan is the only place enamored with Holland. Have you been to Holland, Michigan where they have a real Dutch windmill that was brought from Holland and re-constructed, surrounded by 150,000 tulips. The mill is operated by a woman who sent to Holland to study and be certified as an official, Dutch miller. See photo and info here:<br/>http://www.cityofholland.com/Brix?pageID=111 -- \"A beautiful oasis on the edge of downtown Holland, Windmill Island features a 248 year old working Dutch windmill \"De Zwaan\" (meaning graceful bird). The windmill, which reaches 125 feet from the ground to the top of the blades, towers over 36 acres of manicured gardens, dikes, canals and picnic areas.\""}, {"author": "Rohit", "date": "2010-05-15 02:09:31", "content": "I saw the your picassa album. It is really neat and clean indeed.<br/><br/>If I have to experience Holland, is it good to come here to go to Holland itself?"}, {"author": "middleagedplague", "date": "2010-05-15 02:30:42", "content": "I wonder how the driver knew that the horse needed the bucket at that moment?"}, {"author": "rheide", "date": "2010-05-15 04:30:07", "content": "Thanks for all the comments! I'm guessing they pavlovtrained the horse to pee only when the bucket is underneath. I wonder if that's possible :S"}, {"author": "Bugg", "date": "2010-05-15 08:32:05", "content": "I will go there... One day. :)"}, {"author": "Songbird", "date": "2010-05-15 08:41:09", "content": "lmao@ like Disneyland but without the fun! I have never really quite grasped the meaning of these \"tiny countries\" would one not just like to visit the real one? lol...."}, {"author": "scarletsculturegarden", "date": "2010-05-15 09:58:50", "content": "It's weird because Japan is dead crazy but at the same time they can also be ultra-conservative! I think your miniature Holland kinda proves that - really good post!"}, {"author": "Vivi", "date": "2010-05-15 10:56:53", "content": "What nice pictures. So colourful. What a clean &amp; tidy place. Love them, specially flower pictures."}, {"author": "jhsketch", "date": "2010-05-15 16:25:04", "content": "Beautiful photographs and thanks for sharing!<br/>Jan"}, {"author": "Morom3t3", "date": "2010-05-15 16:30:39", "content": "Beautiful!"}, {"author": "Augustine Towonsing", "date": "2010-05-15 18:29:54", "content": "Wow! its really amazing. First impression I thought the photo really taken from Holland but actually taken from Japan. Its really wonderful to see another duplicate world. Everything looks very impressive. First of all I thought its really another parallel universes but exactly it is. Perhaps, what you captured and shared with us is considered another proof that the duplicate world doest really exist and yes really belief it does really exist. Hope can visit this place in near future."}, {"author": "florb63", "date": "2010-05-16 05:56:57", "content": "Funny that they don't allow bike riding but allow smoking in the cafes. From what I hear, it can't really be Holland without biking, now, can it?"}, {"author": "ian in hamburg", "date": "2010-05-16 07:34:55", "content": "For what the real Holland looks like in winter, windmills, skating and all, I hope you'll enjoy:<br/>http://lettershometoyou.wordpress.com/2009/01/13/10-things-i-learned-about-skating-in-holland/"}, {"author": "computerwatch", "date": "2010-05-16 08:21:28", "content": "that is very beautiful"}, {"author": "Arjuna", "date": "2010-05-16 11:08:59", "content": "Only a Hollander would call somewhere else three times as beautiful as their own country.<br/><br/>I love it here in Holland. Nowhere else has such a big sky. :D"}, {"author": "William Webster", "date": "2010-05-16 13:48:55", "content": "Only in Japan would they have a Holland themed park, while everywhere else has a china-town (the orient goes everywhere and everywhere else goes to the orient it would seem.)"}, {"author": "rheide", "date": "2010-05-16 14:13:16", "content": "Well, they had a Chinese restaurant in the park :P and a French restaurant. And a Japanese restaurant. But no Dutch restaurant... Although they did have steak house that had chicken steak, salmon steak, hamburger steak but no real steak that they called 'Dutch steak house'. So much for Dutch food culture.."}, {"author": "Katie Silcox", "date": "2010-05-16 16:44:29", "content": "This is a really funny attraction for Japan to have! I've been to Japan and have to say that I'd rather see some more of the country than a man-made Holland! I guess for Japanese tourists, it's a good insight however. I'd like to visit to see how realistic it is... I also believe that there is a model English city somewhere in the USA - I guess it's the same idea behind it. Good luck with your cycle adventure, what a great way to explore!"}, {"author": "Katie Silcox", "date": "2010-05-16 16:44:50", "content": "This is a really funny attraction for Japan to have! I’ve been to Japan and have to say that I’d rather see some more of the country than a man-made Holland! I guess for Japanese tourists, it’s a good insight however. I’d like to visit to see how realistic it is… I also believe that there is a model English city somewhere in the USA – I guess it’s the same idea behind it. Good luck with your cycle adventure, what a great way to explore!"}, {"author": "unforgiven", "date": "2010-05-16 17:41:07", "content": "This blog is very good. Thanks for this. I will bookmark this page."}, {"author": "kenny", "date": "2010-05-16 20:01:35", "content": "I am the first time on this site and am really enthusiastic about and so many good articles.<br/>I think it’s just very good.<br/>Thanks...."}]}