{"comments": [{"author": "Mathieu", "date": "2010-02-09 11:42:28", "content": "ご苦労さまでした！<br/><br/>The cycling trip seems like a good way to move on to something else.<br/><br/>Anyway, a futon will be waiting for you when you make it to Osaka.<br/><br/>Cheers!"}, {"author": "CJ Willcock", "date": "2010-02-09 12:34:16", "content": "Wow! I am incredibly jealous of your plans.<br/><br/>You can come visit my family in Prince Edward Island, Canada anytime. We (PEI) are 15/1000 the size of Japan and have 1/1000 of the population. Most everybody speaks English and / or French. Lots of beaches (no mountains - sorry?) and we have a packed gravel biking trail that runs the length of the island (the old train tracks w/ rails and ties removed).<br/><br/>You will have to learn PHP/MySQL for me to pay you anything and you may still need to eat ramen; maybe live in a tent ;-). You could be an interpreter for a season to all the Japanese Tourists that visit.<br/><br/>I checked a map to see how far apart we are by bike (assuming you in Tokyo, Japan and us in Summerside, PE at Google Maps) -- 16,398 km. It would be a few years journey I expect... and you would need a thermal wet-suit for parts of the journey too (#s 173 and 196).<br/><br/>No matter where your journey takes you, I hope you do well and keep at your blogging -- it's a daily read for me!<br/><br/><br/>All the best,<br/>CJW<br/><br/><br/>P.S. Tokyo  Summerside at Google Maps -- http://maps.google.com/maps?f=d&amp;source=s_d&amp;saddr=tokyo,+japan&amp;daddr=summerside,+pe&amp;hl=en&amp;geocode=FRCUIAIduoZTCCnnVy7whxtdYDGJG1cii2EBLg%3BFT_iwwIdJJky_CmJM8jd1IRfSzHipKEfDOfUUg&amp;mra=ls&amp;dirflg=w&amp;sll=34.887365,-146.704595&amp;sspn=99.252253,228.339844&amp;ie=UTF8&amp;ll=34.885931,-142.03125&amp;spn=99.252253,228.339844&amp;z=3"}, {"author": "Shanna", "date": "2010-02-09 13:12:46", "content": "Trots op mijn grote broer!!!"}, {"author": "Hielko", "date": "2010-02-09 17:14:10", "content": "Succes met wat het ook is wat je uiteindelijk gaat doen. Lijkt me dat je iig een mooi avontuur tegemoet gaat :). Nederland is trouwens zo erg ook weer niet hoor ;)"}, {"author": "Wendy", "date": "2010-02-09 17:19:21", "content": "Glad about your decision. Just do it and follow your heart!<br/>Enjoy your bike trip!:)"}, {"author": "shanna", "date": "2010-02-11 09:12:30", "content": "Uw horoscoop voor vandaag:<br/>LEEUW<br/><br/><br/>Probeer u fantasievoller uit te drukken. U voelt mensen aan en begrijpt wat hen motiveert. Wees niet bang persoonlijke vragen te stellen. Leer uw humeurigheid te beheersen als u bewonderd wilt worden."}]}