{"comments": [{"author": "Xi", "date": "2010-12-28 21:47:36", "content": "Sometimes, you just have to go with the flow and see where life takes you.<br/><br/>As for publishing personal stuff out in the public domain, who knows who's reading..."}, {"author": "Kamil", "date": "2010-12-29 00:13:56", "content": "i've lost a lot of confidence going to university. I'm still trying to claim that back. I feel somewhat more confident now despite not achieving all that I wanted to achieve. Be grateful you have this experience I suppose cause if you gain something you really want after losing out on something else you tend to cherish it that much more. Hope you get your confidence back soon man."}, {"author": "randy", "date": "2010-12-29 00:16:34", "content": "Hm, perhaps lost is not the right word. Suppressed, perhaps? Good night all."}, {"author": "Xi", "date": "2010-12-29 01:52:33", "content": "Whenever I'm lamenting over my PhD, a friend of mine would always tell me that it's short term pain for long term gain."}, {"author": "Xi", "date": "2010-12-29 01:57:39", "content": "'I have confidence in sunshine<br/>I have confidence in rain<br/>I have confidence that spring will come again<br/>Besides which you see I have confidence in me'<br/><br/>http://www.youtube.com/watch?v=vzs0oUUFWmM&amp;feature=youtube_gdata_player"}, {"author": "Kamil", "date": "2010-12-29 10:39:46", "content": "Yay! Stewie!"}, {"author": "Slowvelder", "date": "2010-12-29 10:59:47", "content": "Seems like everything is cyclical (no not cycle!) We have our ups and downs and  learn a lot along the way. Thats how its meant to be.  Enjoy the experience and start saving for that next epic trip :)"}, {"author": "Mathieu", "date": "2010-12-29 13:27:23", "content": "I wonder if Google don't miss talented people because of the way they interview people. I don't like to answer questions under the pressure of someone watching me. I prefer to take my time to \"digest\" the problem and get the big picture, then make an informed choice."}, {"author": "randy", "date": "2010-12-29 13:30:13", "content": "Yeah, I've actually heard/read a lot about that. I think everyone knows that the interview process is flawed (not just for Google, but in general). Finding a better alternative is not easy."}]}