{"comments": [{"author": "blackwatertown", "date": "2010-06-13 10:54:20", "content": "What a cheek. Tell them to get stuffed."}, {"author": "Kamil", "date": "2010-06-13 11:20:16", "content": "I'd do the same...if you want someone to translate kanji for you, and if no other Japanese person is available, Google Translate could help ;)"}, {"author": "vincent", "date": "2010-06-14 06:36:52", "content": "Tax: I had the same when I left Sony a few years ago. I was without a job, but got an extremely expensive resident tax bill. You have to take into account this: it's based on your income of the yeare before.<br/><br/>Resident tax it's very expensive in Japan, but do not forget that it is compensated by low income tax levels<br/><br/><br/>A friend had the same prroblem as you recently. She left her job in December. In March she got a resident tax bill of more than 300.000 yen. As she planned already to move to another Asian country, she just left Japan without paying. You could try the same, but in that case I do not recommend you to come back to Japan"}, {"author": "rheide", "date": "2010-06-14 07:12:46", "content": "Vincent, that sounds very sensible, except that I did not actually live in Atsugi for the past months. I only lived in my apartment for 1 month while I was without a job. I don't understand why I have to pay for 18 months worth of this shit when I was only unemployed and living in Japan for one month. It doesn't make sense to me right now, but when I have more time I will investigate this further."}, {"author": "Wendy", "date": "2010-06-14 14:50:16", "content": "I don't get it. \"And not just the tax since I quit my job, all the tax from this year and last year as well. \"But it seems like you left the job at this year's April,right? You only stayed in Japan for two month. The company supposed to pay for your tax for the last year already. Even without a job being an excuse to pay tax,you only have two month tax to pay,right?"}, {"author": "rheide", "date": "2010-06-14 22:54:47", "content": "Wendy, that's why I'm confused o_0 still waiting for more info from you-know-who..."}]}