{"comments": [{"author": "MatF", "date": "2010-06-23 09:17:44", "content": "Hey Randy,<br/><br/>I agree with you, Insurance (as Banks) are the biggest money stealer. Still we should be glad that in our European countries, hospitals do not let people die in front of their building because they have no money to pay (as opposite to US). You pay for the rest of the society.<br/>Also, when you see price of Hospital, you will be glad to have an insurance if needed... When I had health problem in Japan, I can tell you that the bill was big. I was glad I had an insurance to pay instead of me."}, {"author": "Hielko", "date": "2010-06-23 11:31:54", "content": "Your aversion against health insurance or the concept of insurance is not really rational. Some events have such a big negative downside that you would be unable to deal with it, and you pay to transfer this risk to a 3rd party. Paying for insurance against something as losing your phone - something a lot of people do - is usually not really smart since almost everybody is able to buy a new phone when needed, so there is no reason to pay a premium to transfer this risk to someone else.<br/><br/>And it makes sense too that you don't have a choice with some types of insurance. If you get ill, you don't want and have health insurance, and you are unable to pay the bills; what then?"}, {"author": "rheide", "date": "2010-06-23 11:37:34", "content": "I appreciate the concept of health insurance, I just don't like it that it's forced on me. Admittedly I could get in a car crash tomorrow and break my legs and my arms and my skull, which would be slightly troublesome if I didn't have health insurance. The chance of me getting into a car crash is smaller than 1%, I'm willing to wager. (I don't leave the house much and I don't drive a car) - therefore, I believe it should be up to myself, and not the government, to balance the risks vs rewards in this situation. Whether or not health insurance is useful or not is situation dependent and varies from person to person."}]}