{"comments": [{"author": "Kamil", "date": "2010-08-03 22:16:37", "content": "This must be the most boring post to date."}, {"author": "CJW", "date": "2010-08-04 02:00:48", "content": "I want you in on the single best and most effective innovation I have found in using many many systems over the past years. If you are thinking about a new system, look at this!<br/><br/>I just bought an i5 based system for my workplace that I am extremely happy with. It's 4 GB of RAM - nothing special there. I have two 5850s with the dual DVI option (4 x 22\" wide screen lcds). I am an intense guy with an intense job... ^_^<br/><br/>I read previously here that you were using two 1.5 TB drives in an external RAID 1. This to try and ensure your data survives a single point of failure on one disk. Ever wonder about RAID 0? Like, what's the point of the stripe set - it seems like a waste of a disk drive, right? What goes on in RAID 0 is that you have a single volume that is the combined size of both disks. The hidden benefit of the stripe set is that half of the clusters are written to each drive during each read and/or write cycle and the data throughput limitation of the physical disk hardware is avoided with 2X the hardware to allow faster transfers to and from disk.<br/><br/>Now, if that was the only innovation I bought into with the system, I probably wouldn't have bothered explaining it -- try it with two solid state disks in a RAID 0. Whoa!<br/><br/>I went with 2x Kingston 30GB V-Now SSDs in a fakeRAID, RAID 0 and running Ubuntu 10.04 AMD64 desktop. The OS (swap files, temp. cache, e-mail, other downloads, local copies of SVN, etc.) are running off of the 60GB of SSD stripe set. I added the 750 GB disk from my previous workstation in the system for longer term and private files but haven't actually put anything onto it yet.<br/><br/>This computer is the only thing I have ever used that I would put into a category of being almost transparent between me and the web (lots of network bandwidth at the office). Loading up web-pages with rich media is very, very fast with all local caching done on the SSDs. It really is an experience that should be aside from the moving-parts disk drive experience.<br/><br/>This is the most exciting thing that happened to me today...<br/><br/>Anyway, if you are on a limited budget, put a priority on getting rid of the moving parts in your storage. You can always upgrade the video card later - better than re-installing an OS.<br/><br/>Cheers!"}, {"author": "rheide", "date": "2010-08-04 06:57:29", "content": "Thanks for the advice! I'm actually using an OCZ Vertex Turbo as my boot disk. Been thinking about buying another one to do the RAID 0 trick you mentioned, but money constraints... &gt;_&lt;;"}]}