{"comments": [{"author": "b", "date": "2010-04-22 08:02:38", "content": "I think what's most interesting is how your cycling trip is like a mini-metaphor for life in general. There are a few parallels from your post today that had me smiling:<br/><br/>\"This [life] is not the challenge I had hoped for.\"<br/><br/>\"This [life] does not provide me with ... enough time to think about why I [was born] in the first place.\"<br/><br/>\"I’m not sure any more what I’m supposed to be doing every day.\"<br/><br/>\"On the one hand I want to enjoy [the good things in life], but the uncertainty of [the bad things] are making this difficult.\"<br/><br/>And my favorite (in this new context):<br/>\"Anyway, I’m too stubborn to give up something I’ve already started, so I’m definitely seeing this through to the end, even if the end is meaningless.\"<br/><br/>Based on your internal conflict, it looks like your philosophical journey is off to a good start. You weren't getting this wet and tired just for some exercise, right?<br/><br/>Perhaps cycling seems just like swapping out one daily grind for another, but the important distinction is now you're working for yourself and not somebody else. In the same 24-hour day that everyone shares, you now have time to focus on thinking about yourself instead of other, less important distractions.<br/><br/>I know you have a map for your cycling, but do you also have one for your introspection? This voyage of self-discovery might be frustrating or aimless if there isn't a set of important questions to guide your thinking.<br/><br/>So write down a few. What do you hope to find out?<br/><br/>I just started reading The 4-Hour Workweek, so many of these are fresh in my mind, such as: \"How would your priorities and decisions change if you could never retire?\"<br/><br/>\"What is the pot of gold that justifies spending the best years of your life (working and) hoping for happiness in the last?\"<br/><br/>\"Two hardworking chaps are headed toward each other. Chap A moving at 80 hours per week and Chap B moving at 10 hours per week. They both make $50,000 per year. Who will be richer when they pass in the middle of the night?\"<br/><br/>(I won't add anymore to risk diluting what's already here. Have fun!)"}]}