{"comments": [{"author": "Liou", "date": "2011-04-23 02:06:35", "content": "Dude! Catania is the best town in Sicily, try to mingle with the local students!"}, {"author": "randy", "date": "2011-04-25 14:48:54", "content": "Um, really? The very center was kind of nice, but everything else looked like a slum. So far I am much liking the countryside of Sicily a lot better."}, {"author": "mike", "date": "2011-04-27 21:26:05", "content": "Sicily is both geographically and historically the center of the Mediterranean and has been coveted, fought over and colonized for thousands of years. Sicily is a celebration of the greatest achievements of western civilization: the superbly well-preserved Greek temples of Segesta and the Valle dei Templi; the fortifications of Syracuse; the Norman Royal Palace and Palatine Chapel in Palermo and Monreale Cathedral; the gorgeous baroque masterpiece cities of Noto and Ragusa and Catania, and many others. The list is seemingly endless. I am A Sicilian American whose ancestors left our beloved homeland in the 1880’s. I have traveled to Sicily many times and found it to be a clean and enchanting heaven populated by fine, educated, intelligent, caring people. To state that Catania is a “dump’ is blatantly racist and totally false.  In the last century Germany and the German people have  directly murdered and slaughtered over 250 million innocent human beings and have committed horrible heinous atrocities. Do you mention that when you go and write about Germany? The British, with their “empire” subjugated millions of people and “stole” from their most of their wealth- but no mention of that also. Japan is never photographed on a cloudy day, even though it rains almost every other day and it’s “yazuka” is the largest and considered the most deadly organized crime group in the world- no mention ever of Japan as an “infamous island” with a “criminal legacy”.  Sicily has become one of the most popular tourist’s destinations in the world and people all over the world dream of visiting Sicily. People “fall in love” with Sicily and her wonderful people. But I am very leery when “Anglo” and Northern European types like you visit Sicily bringing with them centuries of racist hatred and bigotry nurtured by decades of never-ending negative stereotyping.   Shame on you."}, {"author": "randy", "date": "2011-04-29 20:36:51", "content": "It seems like you hate northern Europeans. Stop being such an asshole."}, {"author": "kevin Shaw", "date": "2011-04-29 20:44:13", "content": "I agree catagorically with Mike...this blogger knows nothing about Sicily.  Catania is such a great city. With Etna at the background, who wouldn't like it?? Those bloody Northern Europeans just massacre people and go around criticising other cultures. A bunch of savages. Go Mike!!!!"}]}