{"comments": [{"author": "husky", "date": "2011-05-31 13:55:33", "content": "Have you heard of CouchSurfing? Just came across this article - http://www.denizenmag.com/2011/05/couchsurfing-and-the-mobile-identity/"}, {"author": "randy", "date": "2011-05-31 13:58:17", "content": "I did actually! I tried to use it once in Japan, but never actually stayed with someone. My lack of planning prevented me from using it properly, since most places require you to inquire at least a week in advance. Might try it again in the future though."}, {"author": "Thomas", "date": "2011-10-24 14:43:01", "content": "If i'm not mistaken it's this quote you're searching:<br/><br/>“The traveler sees what he sees, the tourist see what he has come to see, “- By Gilbert Keith Chesterton <br/><br/>Now my question, as if you've explaned above, de traveler doesn't have preconceptions so the tourist may visit only those things he decided back home? <br/><br/>Is it wrong to interpret the quote as follow: the tourist see what he is seeing by sight-seeing?<br/><br/>If you can't understand my English, it's because I'm Dutch so.. :)"}, {"author": "ann", "date": "2012-01-18 14:38:05", "content": "a traveller is out there to enjoy what the place  has to offer, while a tourist has a deeper purpose in visiting a certain place and is ready to embrace the spirituality and mystery it entails &lt;sorry for my english/i&#039;m practising :-0"}, {"author": "hedley", "date": "2012-03-10 09:50:16", "content": "Tourism comprised the activities of persons travelling to and staying in places outside their usual environment for not more than one consecutive year for leisure, business and other purposes while Tourists are people travelling away from home for more than 24 hours and for a range of reasons like business pleasure and health but not earning Strategic objectives - tourism"}, {"author": "Taofeek Kolawole", "date": "2012-08-26 11:21:08", "content": "Very clear in explaintation"}, {"author": "Leul Yohannes", "date": "2012-11-08 07:53:48", "content": "wonderful explanation in solving the ambiguity!!!"}, {"author": "The Two Faces of Travel and Tourism: Phuket | The Wrinkled Balloon", "date": "2013-06-07 03:35:49", "content": "[...] true traveller [is] soaking it up like a sponge,&#8217; they will go anywhere and do anything. And The Colorful Wolf adds a little more [...]"}]}