{"comments": [{"author": "b", "date": "2011-02-05 12:08:07", "content": "&gt;Lately I tend to be careful with my wording on this blog, especially when I was still searching for a job. I didn’t want potential employers to read something they didn’t agree with.<br/><br/>Haha, success! Thanks for re-affirming why I don't feel so cowardly for always hiding behind a veil of anonymity with all of my \"compartmentalized\" blogs. I think for people that don't know me or wouldn't care to listen to my explanation, it comes off as frighteningly \"tin-foil hat.\" Of course, those people are the ones I care the least about, so no worries. When I write (much like when I speak, unfortunately), it's raw and uncensored - sometimes bounding across the proverbial \"line\" at the expense of various races, ethnicities, and (heaven forbid) myself.<br/><br/>It's simply more fun that way!<br/><br/>As you've thoughtfully mentioned, the idea of some HR department head taking my drivel seriously, getting her panties in a twist, and ruining my career is an all-too-possible reality I don't want to experience. (On the other hand, it would probably make me focus much harder on entrepreneurship!) It's frankly terrifying how quickly the \"politically incorrect\" things a person has <strong>SAID</strong> can be used so effectively to eclipse and ruin those who have actually <strong>DONE</strong>. What a bunch of pathetic gossip it is...<br/><br/>Anonymity is the best shield against these \"easily-offended\" twatsticks until they all die off. I pray to Bill Hicks that this next generation - those who have grown up online and have been swimming in its limitless supply of baseless hate, appalling violence, and shockingly inventive ways to fuck anything and everything - won't be whining and crying about something they encountered that was \"offensive.\" (The obvious next step in this evolution is people <i>finally</i> being able to omit the requisite \"I'm not anti-semetic, but..\" before they can point out how <em>inhuman</em> Israel's policies and actions towards the Palestinians are.)<br/><br/>Anyhow, this world free from fear of repercussion for stating one's ideas is a long way away. Freedom of speech will probably forever be under attack by governments and the panty-twisting humourless. After all, supporting freedom of speech means supporting the right of others to say all those things you disagree with!<br/><br/>Don't Jew me out of my freedoms."}, {"author": "randy", "date": "2011-02-05 12:17:47", "content": "Well, I think both our feelings about freedom of speech and what we are actually able to say online are quite similar. But with this kind of post I believe I can make a statement about myself, stating that \"Whichever potential employer reads this and takes it seriously, is probably not an employer I want to work for\". Therefore, by stating my actual thoughts online, I am reducing the chance of potential mismatch. And who knows, perhaps someone who does somewhat agree with my views of life will read it and give me a chance to do something incredible. You never know. Anonimity as an online lifestyle is a given, and cannot go wrong. I'm betting on honesty."}, {"author": "randy", "date": "2011-02-05 14:46:44", "content": "I guess I just wrote what xkcd already said: http://xkcd.com/137/"}]}