{"comments": [{"author": "Arzamas-16", "date": "2011-02-21 22:19:15", "content": "Difficulty adjustment is not so much about limiting the supply of bitcoins. Block generation is how the network verifies transactions, and getting 50 BTC per block (for now) is only a nice bonus for maintaining the network. The difficulty system aims to limit block generation to one every 10 minutes on average, so the entire network has time to agree on which block is the latest."}, {"author": "Xi", "date": "2011-02-22 01:14:11", "content": "Sorry, feel asleep after the first few paragraphs. Lets cut to the chase, have you made enough for us to book the Poseidon Suite at Burj al Arab?"}, {"author": "Pirate Party", "date": "2011-04-14 12:57:10", "content": "Im in webhosting business, will now use my 4/8Core servers to generate some ;)"}, {"author": "Sancho", "date": "2011-05-24 19:00:49", "content": "The difficulty level isn't necessarily increased for every period. If a bunch of people leave the mining population, the difficulty level will be adjusted downwards to keep the Bitcoin block generation rate at one block every 10 minutes.<br/><br/>This would happen if the market price of Bitcoins drops below what would be profitable at a given difficulty level. This would also happen when the payout per block drops from 50 to 25 (which will happen at block 210001)."}, {"author": "Bob", "date": "2011-05-26 02:56:47", "content": "Don't bother with bitcoin. It's basically a pyramid scheme being pushed by those who already have bitcoins. Period."}, {"author": "randy", "date": "2011-05-26 10:33:41", "content": "Bob, you are very wrong, but I really don't feel like explaining why. Go read up on the Bitcoin wiki here: https://en.bitcoin.it."}, {"author": "Dag", "date": "2011-05-30 00:44:35", "content": "Two words: Silk Road. That's why Bitcoin will succeed."}, {"author": "irony", "date": "2011-06-03 00:46:05", "content": "the bitcoin just breached the $10 margin... looks like the optimists were right!<br/><br/>... i just made 40 thousand. :D"}, {"author": "zachaysan", "date": "2011-06-03 20:17:07", "content": "Yep, over $14 today :)"}, {"author": "hindsight", "date": "2011-06-04 03:16:10", "content": "I have just learned of bitcoin in the last few days and wish I was more involved in internets 6 months ago :(<br/><br/>missed opportunity"}, {"author": "Nymo Amonys", "date": "2011-06-09 18:35:59", "content": "Except that is very clearly is, if not a pyramid scheme, a scheme which gives certain powerful and wealthy individuals absolutely disproportionate profits through the work of others who receive only a minute fraction of them.<br/><br/>I am not talking (only) about the sickest miners with the best rigs. Besides, they used and paid for their electricity. The problem is the control exerted by the pool operators.<br/><br/>It is easy to see how enormously the pool operators profit. They claim the fee of 2-3% (which translates to 1-1.5 BTC) is required to maintain the pool. However, a simple calculation reveals a single operator of a major pool makes hundreds or thousands of dollars' worth of bitcoins daily by maintaining it. One does not need these kinds of amounts of money to maintain a server or even a dozen.<br/><br/>The thing is, I am perfectly fine with this. Everyone is a voluntary participant and is able to track his/her profits (or usually lack thereof) virtually in realtime. Besides, what people are contributing here is some computation time, getting big electricity bills. Compared to the massive Ponzi schemes where people lose their lifetime savings and their houses this is just another nice little game on the Internet for most. One doesn't really lose anything of substance even though he might not (and most likely will not) profit from mining, be it pooled or solo.<br/><br/>We still shouldn't delude ourselves by thinking that this doesn't follow the same path as any \"money for free\" scheme: the early bird gets the worṃ (gets the easiest bitcoins and ends up having the most of them). Additionally, as in any scheme seen so far, the ones early in the game get to use the others to further increase their profits, usually maintaining a faster rate of profit than any of the people who entered the game later. We are already past the point when this starts happening and we can easily observe it happening right now thanks to the extensive market data and statistics. It can't be stopped. It is just the nature of this beast."}, {"author": "Justin", "date": "2011-06-11 13:38:21", "content": "The good news is that federal governments will just let this continue no problem..."}, {"author": "john smith", "date": "2011-06-14 10:35:50", "content": "the guy that made 40K....bad luck on missing out on another 40K by waiting a week lol"}, {"author": "Miner", "date": "2011-06-16 16:23:33", "content": "I just put together a new site to help beginners start mining Bitcoins. It gives you all the basic information for people who are new to Bitcoin and want to get started. Follow the steps and get going. <a href=\"startbitcoin.com\" Title / rel=\"nofollow\">"}, {"author": "dummyseo", "date": "2011-06-23 05:58:12", "content": "this is so far the best bitcoin explanation i've found<br/>thanks"}, {"author": "John Doe", "date": "2011-06-24 23:58:01", "content": "Sir who made 40,000 dollars, mind sending some of that my way?  I'll love you forever ^_^"}, {"author": "thomas", "date": "2011-06-28 08:34:24", "content": "<cite>a scheme which gives certain powerful and wealthy individuals absolutely disproportionate profits through the work of others who receive only a minute fraction of them</cite><br/><br/>aaaaa that's capitalism all about mate :]"}, {"author": "j4y", "date": "2012-07-15 02:45:05", "content": "If you got in early and generated some coins, you won.  These days it really only works if you aren't the one paying the electric bill."}, {"author": "Good day! I simply wish to give an enormous thumbs up for the good data you may have here on this post. I might be coming again to your blog for extra soon.", "date": "2013-03-03 01:22:42", "content": "You made some decent points there. I seemed on the web for the issue and found most people will go along with with your website."}]}