{"comments": [{"author": "Yves", "date": "2011-07-11 11:34:33", "content": "Thanks, just when I was beginning to give up on Java being able to access the web-camera I find this little gem :). Are there any additional libraries I need to download to get the Eclipse project working?"}, {"author": "randy", "date": "2011-07-11 11:39:00", "content": "I believe everything's included. Note that you will probably have to host it somewhere to get it to work. When I tried it on Windows the applet wouldn't load the required jar files, even if they were placed in the same folder as the html file. Since the webcam component is a Swing component you can just add it to a JFrame and use that for testing."}, {"author": "Jeffry", "date": "2011-08-23 13:37:06", "content": "Hi, could you also provide tutorial to run it on desktop ? That would be great. Thank you.<br/><br/>Jeffry"}, {"author": "randy", "date": "2011-08-23 13:49:41", "content": "Sorry, that'd be out of the scope of this article. (Read: I can't be bothered :P) It's fairly easy to do though, just check the applet source code for how it calls the webcam and put it in a JFrame instead."}, {"author": "Michael", "date": "2011-08-26 15:07:39", "content": "Hi, I've read the code and realized some of the key classes you use, particular for accessing the local webcam, are from com.googlecode.javacv.OpenCVFrameGrabber. is there any particular reason you did so? <br/>Also, do you know how to create a DataSource type for the grabbed images in your code so I can use RTP (from JMF) to stream the webcam video?<br/><br/><br/>wonderful work, by the way"}, {"author": "randy", "date": "2011-08-26 15:11:26", "content": "Hi Michael, that's a very interesting idea, but I'm afraid I haven't worked with JMF a lot so I can't help you there. As for the OpenCVFrameGrabber, I'm not sure I understand your question. I use it because that's the entry point to OpenCV from Java, which gets you access to the webcam."}, {"author": "kris", "date": "2011-10-21 07:22:42", "content": "Hi, Thanks for your tut, which is absolutely helpful. I got a question about i need to capture webcam image by clicking a button and i need to pass it to the jsp. So could please advice where exactly i need to add this changes in your app,<br/><br/><br/>Thanks,<br/>Kris"}, {"author": "Kirill", "date": "2011-11-10 18:54:12", "content": "In the function cvCreateCameraCapture(i) I see<br/>---------------------------------------------------------------------<br/>Exception in thread \"Thread-4\" java.lang.UnsatisfiedLinkError: Unable to load library 'cxcore': The specified module<br/>---------------------------------------------------------------------<br/><br/>How to Fix that ? :)"}, {"author": "Sumit Khanna", "date": "2011-12-09 16:41:40", "content": "Hey i got the same excepiton <br/>------------------------------------------------------------------------<br/>Exception in thread “Thread-4″ java.lang.UnsatisfiedLinkError: Unable to load library ‘cxcore’: The specified module<br/>------------------------------------------------------------------------<br/><br/>Can you tell why is this exception coming??"}, {"author": "ket", "date": "2011-12-17 05:10:05", "content": "I've been searching for years only to learn that PHP and Ajax can also do this job. And for screen capture, Javascript and HTML5 can be easily make it with a breeze too."}, {"author": "Rafael Toledo", "date": "2012-02-13 17:05:53", "content": "Hello! I'm coding an webapp where I need to get a fingerprint from a device, and I'm trying to do this based on your solution. But I'm getting some trouble accessing the files through JNA. Firstly, I've permission troubles. Secondly, I'm getting a exception \"java.lang.NoClassDefFoundError\" saying that Java cannot initialize com.sun.jna.Native. Can you help me to configure the jars and permissions to put this to run? Thanks (:"}, {"author": "Bhooshan", "date": "2012-02-23 07:27:14", "content": "Hello Randy,<br/>I am able to access webcam using applet, but when it showed to the QR code nothing is happening, is there button to capture the code or it will automatically take care of everything once the it read QR code."}, {"author": "Shilpi", "date": "2012-03-22 08:09:58", "content": "I am unable to use this applet through MAC systems. Please let me know how I can use this applet to record video through MAC systems."}, {"author": "xino", "date": "2012-04-04 19:55:55", "content": "I have the same issue.<br/>Nothing is happening on qr code reading."}, {"author": "Andras", "date": "2012-04-24 17:27:45", "content": "Hi Shilpi,<br/><br/>this could be because Randy's code only download windows specific dependencies. WebcamApplet.java line 56. <br/>private final static String[] LIBS = { ... }<br/><br/>You can change this list to Mac OS specific ones but in this case you should update DEFAULT_DOWNLOAD_PATH as well."}, {"author": "Shilpi", "date": "2012-05-11 06:59:07", "content": "Thank you Andras, but where do I find the dependent library for MAC machine.....please help..."}, {"author": "Murat", "date": "2012-10-11 10:46:58", "content": "I downloaded project via this link http://colorfulwolf.com/dev/cam/WebcamApplet.zip<br/>but in local web-site form does not working<br/>open demo.html but browser can not open"}, {"author": "Bartosz Firyn", "date": "2012-11-30 00:01:16", "content": "Unfortunately this applet does not work in my case. Have no idea why (I use Java 7, maybe this is the root cause). It shows some progress bars informing me about files being downloaded, but after this I see only blank white screen... Nothing happens and camera don't start. <br/><br/>Therefore, I've created my own Applet demo of how to use PC webcam in Java Applet (it does not use OpenCV / JavaCV !!!). Source code can be found in the examples for my Webcam Capture project https://github.com/sarxos/webcam-capture/tree/master/webcam-capture-examples/webcam-capture-applet<br/><br/>And here you can find working example http://webcam-capture.sarxos.pl/examples/applet/<br/><br/>I tested it on my home PC running JDK 1.7 and at my work PC running JDK 1.6. In both cases it works perfectly.<br/><br/>Cheers!"}, {"author": "Fabian", "date": "2013-01-10 10:31:50", "content": "You made my day dude. Thanks for your project, it really helped me!"}, {"author": "Hassan Arif", "date": "2013-01-19 19:22:41", "content": "Dear respected,<br/><br/>I am also trying to run this example. But my compiled applet is not running. Can you help me how to run this example, so that I can proceed with my work?<br/><br/><br/>Kind regards,<br/>Hassan Arif"}, {"author": "Khushbu", "date": "2013-02-04 17:59:14", "content": "I am unable to run it.. Please post where and what settings to be done in order to execute it<br/>Thank you"}, {"author": "mlong", "date": "2013-04-02 10:54:00", "content": "Hey i got the same excepiton<br/><br/>Exception in thread “Thread-4″ java.lang.UnsatisfiedLinkError: Unable to load library ‘cxcore’: The specified module<br/>I tried to correct it by : properties my project,java build path,libraries and add native  library  location *.dll<br/>but i can't fix it :| help me"}, {"author": "maha", "date": "2013-04-12 18:15:14", "content": "i got green images :(<br/>why ?"}]}