{"comments": [{"author": "Alex", "date": "2011-05-31 12:16:57", "content": "This actually brings up an interesting point that politicians might use against bitcoin: By design every real dollar of value that is added to the bitcoin system entails approximately one dollar of wasted energy. And no one these days wants an energy crisis."}, {"author": "Murray Mises", "date": "2011-05-31 12:32:22", "content": "Physical gold mining is similar.  Every dollar of gold mined entails approximately one dollar of resources consumed by the miners.  As far as I know, politicians are not using this against gold miners or any other producer commodities (note that I am not saying that bitcoin is a commodity, only that the principle applies to commodities)."}, {"author": "Bitcoinfrance", "date": "2011-05-31 12:32:59", "content": "interesting, gonna try to translate this article in french :)"}, {"author": "Hielko", "date": "2011-05-31 12:33:08", "content": "Your argument is missing one important factor; security. The huge amount of computerpower used to generate bitcoins is not wasted, it's protecting the network against attacks."}, {"author": "billybobbitcoin", "date": "2011-05-31 12:36:18", "content": "Uh you missed the biggest point.  If everyone \"agreed\" to only use 1% of their computing power the network would now be 100x more vulnerable to attack.  The mining secures the network, the more \"wasted\" energy and cpu cycles, the more secure the network.  So it's not being wasted...  go read a book"}, {"author": "iamreddave", "date": "2011-05-31 13:12:50", "content": "Could something like bitcoin be based on a 'useful' search? For Mersenne primes or counter examples to a well known conjecture?<br/><br/>I think not because what is being mined needs to have a regular discovery timetable and mining maths is basing the value of your currency on no one improving maths. Mind you current bitcoin hash based mining is also based on that."}, {"author": "Scott", "date": "2011-05-31 13:15:46", "content": "So you're effectively asking for price fixing?"}, {"author": "randy", "date": "2011-05-31 13:18:20", "content": "Not quite. As I mentioned in the article, it seems that demand for bitcoins fuels the price, so even if you change the computational difficulty the demand and the supply will not change. It shouldn't affect the price at all."}, {"author": "Saturn7", "date": "2011-05-31 13:22:40", "content": "If everybody agreed to use 1% of computing power per 'computer' then the \"waste\" or \"growth\" would be transferred to having to buy 100 computers to do the work 1 computer could do. Now that's a real waste."}, {"author": "Glenn Gillen", "date": "2011-05-31 13:28:05", "content": "It's not being used against gold because:<br/><br/>1) Gold hasn't been mined for currency in decades.<br/>2) Gold miners run a profitable and tax paying business, whereby even after all the extraction and  processing costs they turn a healthy profit at the current rate."}, {"author": "Tom", "date": "2011-05-31 13:32:56", "content": "I believe that the entire beauty of the Bitcoin environment is that it is driven by the well-known force of capitalism. Thus if someone follows your suggestion and releases client that uses only 1% of resources no-one would ever adopt because.. well we (as a human kind) are greedy by nature. That's why capitalism works better than socialism.<br/><br/>For those interested in becoming miners I've published <a href=\"http://doppnet.com/2011/05/mining-bitcoins/\" rel=\"nofollow\">an article on Bitcoin Mining</a> couple of days ago, could be helpful :)"}, {"author": "Bitcoin, capitalisme et nature humaine - Informations et actualités des bitcoinsInformations et actualités des bitcoins", "date": "2011-05-31 13:36:22", "content": "[...] article fait suite à une réflexion de randy sur ton blog colorfulwolf.   Le 31 mai 2011 &#8211; 15 h 36 min | Auteur : bitcoinfr | Catégorie : Reflexions | Mots-clefs : [...]"}, {"author": "joo", "date": "2011-05-31 13:49:50", "content": "There's a natural limit to how much computation will be applied. We can expect the cost of mining to approximately equal the price of the new bitcoins awarded. <br/><br/>New bitcoins are a small portion of the bitcoin economy, and the proportion shrinks dramatically as time goes on.<br/><br/>As bitcoins get pricier, it will become worthwhile at some point to build custom-designed ASICs to mine them. These will likely be much more power-efficient, but costly. In that case people will spend most of their mining investment on hardware, rather than electricity."}, {"author": "el_chapitan", "date": "2011-05-31 14:36:07", "content": "We could start computing very hard problems (like primes, golomb rulers, etc), and then have the amount of bitcoins for the prize get larger every day a solution is not found.<br/><br/>It would be like the Powerball, but for a good cause."}, {"author": "Michael", "date": "2011-05-31 14:49:48", "content": "http://en.wikipedia.org/wiki/File:World_production_gold2.jpg<br/><br/>2500 tonnes per year."}, {"author": "Joey Robert", "date": "2011-05-31 14:58:33", "content": "<blockquote><br/>There is a solution to this problem. If someone releases a new Bitcoin client (and miners) that run on only 1% of the available processing power, and gets more than 50% of the network to adopt this new client, then total electricity costs drop would drop hugely, and still the same amount of bitcoins would be generated.  The demand for bitcoins sets the price, and the supply won’t change, so everybody profits. Yet we all choose our own success, which ultimately has negative consequences for everyone involved. That’s just not smart.<br/></blockquote><br/><br/>You're talking about lowering the cost to compute bitcoins. All it would take it one person using a non-crippled client to destroy the Nash equilibrium. Bitcoins are necessarily rare based on computing power, but I agree, if there was a way to make a new resource rare not based on computing power (but based on time, or something else), it would be much more efficient."}, {"author": "b", "date": "2011-05-31 17:10:01", "content": "Grats on getting HN frontpage, buddy ;)<br/>What a surprise to see at work this morning!"}, {"author": "", "date": "2011-05-31 17:15:38", "content": "\"for currency\""}, {"author": "frevd", "date": "2011-05-31 17:18:43", "content": "well, there is - simply include time-dependend variables in your calculations - no unneccary power wasted, but the values are known only at that time (mining power would then go into prediction and into faster network transmission technology, which is eventually of some use). <br/>I strongly agree with his main point, that buring all our rain forest for such a stupid algorithm that does not help anybody afterwards is a major problem."}, {"author": "frevd", "date": "2011-05-31 17:21:00", "content": "some examples: whether forecast, stock forecast, forex options etc., even birth rates - whoever is nearest earns the coin, no need to permanently calculate rubbish, only submit best guess in time."}, {"author": "frevd", "date": "2011-05-31 17:21:42", "content": "*weather"}, {"author": "joo", "date": "2011-05-31 17:38:26", "content": "They're still mining plenty of gold, and since gold is fungible you can't really assign particular use to that mining.<br/><br/>Your second point seems equally applicable to bitcoin miners. They're providing a valuable service, too...creating a global sequence of transactions to prevent double-spending. When new coin creation stops, we'll still need the miners, and we'll pay them with transaction fees."}, {"author": "Mark", "date": "2011-05-31 19:32:57", "content": "My Initial thoughts about bitcoin were the effective loss of CPU cycles or should I say wasted CPU Cycles.<br/>If for example the CPUs were working on problems like protein folding or something that would have a direct benefit for society as well as mining for non existant or even some kind of tie in between the both, as a whole it would be a much cooler project."}, {"author": "Eduardo", "date": "2011-05-31 19:48:48", "content": "It is a really nice article but there are some really good comments too. <br/>As a bitcoin enthusiast &amp; miner I will try sum all things said and give an honest feedback in my blog. Congrats on getting HN frontpage."}, {"author": "Ken", "date": "2011-05-31 20:42:38", "content": "Correct. The computation is creating a highly valuable record of bitcoin transactions that gives the currency its \"value\". Without this competitive computational effort, the transaction record would be easy to forge or manipulate.<br/><br/>Think of it as building the sewer system underneath any major city. The cost is absolutely enormous, as is the energy expenditure. But the result is a very useful public utility that -in the case of sewers - has an immeasurable impact on human health.<br/><br/>I predict that Bitcoin will eventually have a similar effect to the monetary system as sewers have had on sanitation. Whereas sewers help to carry waste away, preventing the spread of disease, Bitcoin enables lower cost financial transactions and the removal of intermediary layers (credit card companies and financial institutions) that stand in the way of free and open commerce.<br/><br/>How much energy could we all save by taking down Visa?"}, {"author": "Fellow Traveler", "date": "2011-06-01 06:58:36", "content": "Resources are utterly wasted on the manufacture and maintenance of locks, vaults, and armies. If only we could all agree on certain basic (and just) principles, principles that certainly everyone would agree to anyway if they were interviewed one-at-a-time, then we could forgo all of those costs and live in peace and harmony.<br/><br/>While the early days of Bitcoin gave it a reputation as a \"waste\" of resources, perhaps we should learn to see those resources as the very real cost of human nature, no different than the cost we pay to have a well-maintained police force in our own communities...<br/><br/>...and certainly must less than the cost we all pay now with the current system based on the IMF, the Federal Reserve, etc. Any statement that Bitcoin is wasteful certainly should qualify itself with a quick recitation of the COSTS OF OUR CURRENT SYSTEM:<br/><br/><br/>--- The hidden tax of inflation, especially on our poor and elderly.<br/><br/>--- The high personal cost of the federal income tax, which just barely covers the amount of our interest payments on the national debt. (No, it doesn't pay for any of your government services, or anyone else's, surprised?)<br/><br/>--- The national debt itself, which presumably must be defaulted on at some point, or inflated away, in either case devastating the savings of our elderly and forcing them to rely more on taxpayers for their medical and other care. This will unfortunately drive a cultural attitude of negativity against the elderly, when previously they were the ones with the most resources (and wisdom) in any family. <br/><br/>--- While women are a great benefit and value to the workforce, the fact remains that many of them only work because they have to, not because they desire to. This is because the cost of living is so high, due to the income tax and its secondary effects on the rest of the economy. Many do not realize that the high personal cost they pay every day, as their children are raised in government farms, is directly and solely in order to service the national debt.<br/><br/>--- The cost we pay in terms of the wars that are financed by our national debt -- wars that otherwise the powers that be would be unable to afford through direct taxation, yet now have foisted upon us to pay through the blood of our children, and the mortgaging of their future to the banks.<br/><br/>--- The cost we pay in terms of having a monopoly banking system, which has control over our money supply, the life's blood of our economy! We all know that banks are bureaucratic and slow, and frustrating -- it's because they have a monopoly! And our economy pays the price of having a monopoly banking system, just as the Soviet Union paid the price for central planning, and just as ordinary, hard-working German citizens paid the price during the Weimar Inflation, when all of their savings was stolen from them by an elite -- eventually leading to the rise of the Nazi party.<br/><br/>--- The cost we pay in terms of the Great Depressions that are cyclically brought upon our nation through the misallocations that are consequential to the mistake of allowing a central committee of corrupt bankers to have direct spending access to everyone's savings and retirement.<br/><br/>--- The cost we pay in terms of our rights and freedoms, as the income tax is then used to shape our behavior in terms of the penalties, incentives, and deductions that are built into the system. Designed, of course, by lawyers and lobbyists for powerful corporations, passed by Congress, and imposed upon you, and your parents, and your children -- all in order to shape your behavior, and to structure the system so that working for one of those corporations is the only way you can afford to pay your bills.<br/><br/>--- The cost we pay in our general standard-of-living, while our children are raised in government schools and by MTV: because we are all too busy working (with no vacation), as the infrastructure of our once-great nation crumbles all around us, along with her culture. Anyone can see the roads have potholes after a rain. Will today’s Western Man, having grown dull and fat amidst all his luxury, awake to find the Empire of the West has crumbled around him along with its morals? Do not the other nations have the same access to western economic knowledge and theories of government to become as powerful as we? Do we think that we are so much better than other people, such that living in less luxurious circumstances than we are currently accustomed is somehow outside of the bounds of our reality?<br/><br/>--- The cost we pay in terms of our personal security, and that of our women and children, as our economy declines and our military might necessarily declines with it. (And as the decline in culture and economy leads to higher costs of blood and treasure due to increases in crime, as happened to Argentina in 2001 when she ceased to be the tenth richest nation in the world, and instead became a place where families had to eat out of garbage cans.)<br/><br/>--- The cost we pay as we age, and are forced into government-hospital-projects, and government-elderly-care-and-quality-of-life-facilities, and as our children are funneled into government \"employment opportunities\" building dams, nation-building, UN patrolling, ditch digging, driving trucks and burying bodies for Uncle Sam, because the economy sucks so bad that no one can get a normal job or start a company anymore--because the institutions that once acted as our agents protecting our freedoms, with one-representative-per-every-30,000 people--with every neighborhood having a voice--have instead become tentacled abusive nightmares, answering only to bankers, large corporations, government employees unions, and sporadic voter anger.<br/><br/>--- The cost we paid in terms of our skill-sets, competitiveness, education, and off-shored industry, as a result of being allowed to grow dull and fat through several decades of economy misallocation by way of the world's use of dollars as a reserve currency. They sent us their microwaves, their automobiles, their minerals, and their agriculture, while they starved and worked in slave mills, in return for worthless paper dollars, while we sat around playing video games and flipping real-estate, jumping from bubble to bubble like drunken fools, laughing at the worry of our grandparents towards our generation. <br/><br/>Well, they say that in a downturn, money returns to its rightful owner -- a lesson we are likely to learn at the hands of China.<br/><br/><br/>Bitcoin is wasteful of resources??? Let's get some perspective here, people. Otherwise we are entirely blind, and deserve our fate.<br/><br/><br/>\"My people are destroyed for lack of knowledge: <br/>   because you have rejected knowledge, <br/>  I will also reject you, <br/>   that you shall be no priest to me: <br/>    seeing you have forgotten the law of your God, <br/>  I will also forget your children.\"<br/>Hosea 4:6"}, {"author": "grondilu", "date": "2011-06-01 08:49:51", "content": "I made some kind of a conjecture about that on the bitcoin forum:<br/>http://forum.bitcoin.org/index.php?topic=3262.0<br/><br/>There has to be some sort of theorem, proving that once a digital currency is both decentralized and anonymous, then the initial attribution of money has to be related to processing power.<br/><br/>The idea is that since the network is decentralised, the attribution must be kind of random.  And since it is anonymous, you can pretend you are several people, just in order to have more chance to get more money.   Then, just consider that whatever CPU you need to run the program as one person, you need N times more in order to run N instances on the program if you want to pretend you are N people.<br/><br/>That's the global idea anyway."}, {"author": "Mathieu", "date": "2011-06-01 11:04:38", "content": "The same goes for energy: energy is needed to produce energy. In the oil sands in Canada, they need to use 1 barrel to produce 2. Each barrel consumed meaning more green-house effect gazes released in the atmosphere..."}, {"author": "Me", "date": "2011-10-08 00:46:55", "content": "The computational effort does not have to be competitive.  It being competitive is what causes the Prisoner's Dilemma.<br/><br/>Also, the psuedo-anonymity of Bitcoins causes another potentially high cost.  The cost of \"trust.\"  If I send somebody Bitcoins hoping for a product or service in return, I really don't know who I sent them to.  They could just keep my Bitcoins, and not send me the product or service without the threat of repercussion.  Also, the \"no chargeback\" feature doesn't remove costs, it just transfers the cost from the receiver of currency to the sender of currency.  Note: this may make it ideal for micro-donations where the receiving party is authenticated by some third-party (trusted certificate authority).<br/><br/>Then there are other costs associated with Bitcoins, like usability, exchange to and from other currencies, and uncertainty about legality, taxation, etc...<br/><br/>I.e. Bitcoin's strengths under some use-cases, are its weaknesses under others."}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | Staf Ahli Jombang", "date": "2011-10-18 16:48:55", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | iPhone 5 News and Information", "date": "2011-10-18 17:01:10", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters &laquo; News Hub Today", "date": "2011-10-18 17:16:25", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | Software News", "date": "2011-10-18 17:24:12", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | iphone new 2012", "date": "2011-10-18 17:44:17", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "BITCOIN VALUE CRASHES BELOW COST OF PRODUCTION AS BROADER USE STUTTERS » BITCOINS, BITCOIN, THAT, MTGOX, TECHNOLOGY, WHAT » TECH MAGAZINE", "date": "2011-10-18 18:16:15", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | Kanak Shah", "date": "2011-10-18 22:43:32", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters &laquo; London New Media", "date": "2011-10-19 03:16:50", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | ForexWorldBlog", "date": "2011-10-19 05:40:17", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below cost of production as broader use stutters | Ellandra", "date": "2011-10-19 06:06:52", "content": "[...] &#077;&#097;&#121; one user suggested &#116;&#104;&#097;&#116; &#116;&#104;&#101; effort being thrown &#097;&#116; Bitcoins &#119;...: &#8220;&#087;&#101;&#8217;re &#097;&#108;&#108; trying &#116;&#111; profit &#102;&#114;&#111;&#109; [...]"}, {"author": "Bitcoin value crashes below production cost | Kanak Shah", "date": "2011-10-20 11:40:17", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "Bitcoin value crashes below production cost &laquo; Science Technology Informer", "date": "2012-03-05 13:19:52", "content": "[...] May one user suggested that the effort being thrown at Bitcoins was wasted: &#8220;We&#8217;re all trying to profit from the high exchange rates (1BTC is 9USD at the time of [...]"}, {"author": "paul toplass", "date": "2012-04-20 08:45:28", "content": "Yes its quite astonishing when you think they go to all the trouble to dig gold out of the ground just to then bury it well back underground again"}, {"author": "Ade", "date": "2012-04-30 06:31:38", "content": "the way to make your bitcoins profitable is not to try to get more of them, as has been explained, the network will work against you.<br/>The way to make bitcoins profitable is to encourage business to adopt bit coin, to set up bit coin accepting businesses and to publicize bitcoin.<br/>The harder you try to mine bitcoin, the harder the network wll work against you, it's a negative feedback loop.<br/>to create a positive feedback loop, that means getting the public to adopt bitcoin.<br/>The bit coin community should be making tiny regular donations, pooled, setting up and supporting bitcoin businesses."}, {"author": "compmaster", "date": "2012-10-17 14:21:27", "content": "Good idea, the French might find this interesting since they don't use real money either."}, {"author": "compmaster", "date": "2012-10-17 14:23:56", "content": "It's no different than what any major credit company does in a centralized data center. The bitcoin effort is simply crowd sourcing the transaction processing in an even more secure way."}, {"author": "Padma Drago", "date": "2012-11-30 09:43:57", "content": "Why is there a need for so much processing power? P2P softwares do not require such a huge amount of power (possibly the world's most powerful supercomputer, at present, until the qubits come).<br/> <br/>The open source code reveals commands written by military/intelligence officials. Is it possible they are using the processing power to hack PGP encryptions? (as the moderator of a certain popular alternate news website has speculated)."}, {"author": "randy", "date": "2012-11-30 09:45:58", "content": "I'm afraid that claim doesn't make much sense. Bitcoin is, as you mention, completely open source so you can see exactly where your calculation time goes (hint: read some articles about Bitcoin 'difficulty' level). The source code has been analyzed by expert cryptoanalysts (citation needed >_<) who would certainly pick up on something like that."}, {"author": "Anonymous", "date": "2013-03-25 13:07:33", "content": "So lets get this clear?  If you are old and have no knowledge of computers your fooked. If you do not have enough to buy top graphics cards your fooked.<br/>Sounds like a real fair and great system no better than one we have already.<br/>What a waste of time, and worst of all ENERGY."}, {"author": "Lord Satan", "date": "2013-04-04 04:42:36", "content": "Not at all, Anonymous. If you buy bitcoins, you can still profit.<br/>If you have no money to buy them... then you have no money either way."}, {"author": "balian.com", "date": "2013-06-07 15:11:29", "content": "Hi, just wanted to mention, I enjoyed this article. It was inspiring. Keep on posting!"}]}